12/data/attachments/e0eb2608490e15bc.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_3c4e9d73-a79d-4401-8307-c9b7dd882177</nif:username>
            <nif:friendToBeAdded>Richard_already_Actions_86426_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>